---
kind: method
id: M:Autodesk.Revit.DB.ConnectionValidationInfo.#ctor
source: html/a89d5926-f7fd-e602-5b04-7fd9e08f2299.htm
---
# Autodesk.Revit.DB.ConnectionValidationInfo.#ctor Method

Constructor.

## Syntax (C#)
```csharp
public ConnectionValidationInfo()
```